In [1]:
import pandas as pd

In [2]:
dict1 = {"Name":["Dan","Elizabeth","Jon","Maria","Mark","Bill","Jess","Julia","Jeff","Ben"],
         "Salary":[40000,32000,45000,54000,72000,62000,92000,55000,35000,48000],
         "Country":["USA","Brazil","Italy","USA","USA","Brazil","Italy","USA","Italy","Brazil"]
}

In [5]:
df = pd.DataFrame(dict1)

In [6]:
df

        Name  Salary Country
0        Dan   40000     USA
1  Elizabeth   32000  Brazil
2        Jon   45000   Italy
3      Maria   54000     USA
4       Mark   72000     USA
5       Bill   62000  Brazil
6       Jess   92000   Italy
7      Julia   55000     USA
8       Jeff   35000   Italy
9        Ben   48000  Brazil

In [10]:
csv_1 = df.to_csv("salary.csv")

In [13]:
pd.read_csv("salary.csv")

   Unnamed: 0       Name  Salary Country
0           0        Dan   40000     USA
1           1  Elizabeth   32000  Brazil
2           2        Jon   45000   Italy
3           3      Maria   54000     USA
4           4       Mark   72000     USA
5           5       Bill   62000  Brazil
6           6       Jess   92000   Italy
7           7      Julia   55000     USA
8           8       Jeff   35000   Italy
9           9        Ben   48000  Brazil

In [17]:
mean = df["Salary"].mean()
mean

53500.0

In [19]:
median = df["Salary"].median()
median

51000.0

In [18]:
mode = df["Salary"].mode()
mode

0    32000
1    35000
2    40000
3    45000
4    48000
5    54000
6    55000
7    62000
8    72000
9    92000
dtype: int64

In [20]:
min_sal = df["Salary"].min()
min_sal

32000

In [22]:
max_sal = df["Salary"].max()
max_sal

92000